Revit 2026 API

# ExportLineweightTableRemove Method

---

Removes the pair (key, info) corresponding to the given ExportLineweightKey.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Remove(
	ExportLineweightKey exportLineweightKey
)
```
```vb
Public Sub Remove (
	exportLineweightKey As ExportLineweightKey
)
```
```cpp
public:
void Remove(
	ExportLineweightKey^ exportLineweightKey
)
```
```fsharp
member Remove :
        exportLineweightKey : ExportLineweightKey -> unit
```

#### Parameters

exportLineweightKey ExportLineweightKey
     The export line weight key

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportLineweightTable Class

Autodesk.Revit.DB Namespace